
## Plan Result

[CI link](https://github.com/kanade0404/zaim/actions/runs/11082844177)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * google_cloud_run_v2_service.app
* Replace
  * module.database-url.google_secret_manager_secret_version.secret-version


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_v2_service.app will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/kanade0404/locations/asia-northeast1/services/zaim-api"
        name                    = "zaim-api"
        # (31 unchanged attributes hidden)

      ~ template {
            # (9 unchanged attributes hidden)

          ~ containers {
              ~ image       = "asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app@sha256:3872aae99f8450962e3ceb316b21bed50da6d3be473cb9f2fa058a04ac5c373e" -> "asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app"
                name        = "app-1"
                # (4 unchanged attributes hidden)

              - env {
                  - name  = "DATABASE_URL" -> null
                    # (1 unchanged attribute hidden)

                  - value_source {
                      - secret_key_ref {
                          - secret  = "database-url" -> null
                          - version = "1" -> null
                        }
                    }
                }
              + env {
                  + name  = "DATABASE_URL"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "database-url"
                          + version = (known after apply)
                        }
                    }
                }

                # (7 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.database-url.google_secret_manager_secret_version.secret-version must be replaced
-/+ resource "google_secret_manager_secret_version" "secret-version" {
      ~ create_time           = "2024-09-28T09:22:59.700480Z" -> (known after apply)
      + destroy_time          = (known after apply)
      ~ id                    = "projects/137094135185/secrets/database-url/versions/1" -> (known after apply)
      ~ name                  = "projects/137094135185/secrets/database-url/versions/1" -> (known after apply)
      ~ secret_data           = (sensitive value) # forces replacement
      ~ version               = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":44,"Program":"tfcmt","SHA1":"3477b3bb256b7a8bf9aec1ab61319482b8d98cd9","Vars":{},"WorkflowName":"Plan Terraform"} -->